![imagen](../../imagenes/sql_murder.png)

# Ejercicio SQL Murder
Para este ejercicio vas a ponerte la gabardina y el sombrero ya que tendrás que investigar un asesinato en *SQL City*. 

Aplicarás los conecptos básicos de SQL y aprenderás a manejarte con un modelo de datos, mientras resuelves un caso de asesinato :)

Este espectacular juego está creado por **Joon Park y Cathy He**, y podrás encontrar todos los detalles en [su web](http://mystery.knightlab.com)

Para realizar el ejercicio tienes dos opciones, o bien desde la propia web, donde encontrarás un intérprete de sentencias SQL interactivo. Si usas esta opción te recomiendo que vayas apuntando las queries y sus outputs. O la otra opción es [acudir a su GitHub](https://github.com/NUKnightLab/sql-mysteries), descargarte la base de datos y realizar las queries desde Jupyter. Probablemente la primera opción te sea más cómoda


### Enunciado
A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a **murder** that occurred sometime on **Jan.15, 2018** and that it took place in **SQL City**. Start by retrieving the corresponding crime scene report from the police department’s database.


### Modelo de datos
![imagen](../../imagenes/sql_game_schemma.png)

¡Suerte Sherlock!

In [23]:
import pandas as pd 
import sqlite3

In [24]:
conecction = sqlite3.connect("sql-murder-mystery.db")
crsr = conecction.cursor()

In [25]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [26]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

crime_scene_report
drivers_license
person
facebook_event_checkin
interview
get_fit_now_member
get_fit_now_check_in
income
solution

In [27]:
query = '''
SELECT * 
FROM crime_scene_report
WHERE date = 20180115 and type = 'murder' and city = 'SQL City'
'''

report = sql_query(query)

In [28]:
report

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [38]:
query = '''
SELECT f.person_id, i.transcript 
FROM facebook_event_checkin f INNER JOIN interview i 
ON f.person_id = i.person_id
WHERE f.date = 20180115
'''

facebook = sql_query(query)
facebook

    person_id                                         transcript
0       56269  cupboards and book-shelves; here and there she...
1       73091  or two, it was as much as she could do to hold...
2       29596  Some of the jury wrote it down ‘important,’ an...
3       38423            it ran away when it saw mine coming!’\n
4       78037              there was silence for some minutes.\n
5       11376  ‘you shouldn’t have put it in with the bread-k...
6       23573               age, there was no more to be said.\n
7       72518  the last time she saw them, they were trying t...
8       82809                                                 \n
9       91104  are; secondly, because they’re making such a n...
10      49525                                                 \n
11      83030                                                 \n
12      28435  away from her as hard as it could go, and maki...
13      23264                                                 \n
14      35366  about in the wood, ‘is to grow to my right siz...
15      32037  ‘Off with their heads!’ and the procession mov...
16      85846                   ever having seen such a thing.\n
17      34256                       more if you’d rather not.’\n
18      89704  finger VERY deeply with a knife, it usually bl...
19      40276                                                 \n
20      58603  ‘Wake up, Alice dear!’ said her sister; ‘Why, ...
21      57237  here directly, and get ready for your walk!” “...
22      53716     Yet you finished the goose, with the bones ...
23      14887  I heard a gunshot and then saw a man run out. ...
24      16371  I saw the murder happen, and I recognized the ...
25      67318  I was hired by a woman with a lot of money. I ...

In [37]:
query = '''
SELECT *
FROM person
WHERE id = 16371
'''

witness = sql_query(query)
witness

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [42]:
query = '''
SELECT ssn, MAX(annual_income)
FROM income
'''

rich_woman = sql_query(query)
rich_woman.ssn

         ssn  MAX(annual_income)
0  361660921              498500

In [44]:
query = '''
SELECT *
FROM person
where ssn = 361660921
'''
name_rich = sql_query(query)
name_rich.name

0    Numbers Cranker
Name: name, dtype: object

In [48]:
query = '''
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = 20180115
'''
sql_query(query)

  membership_id  check_in_date  check_in_time  check_out_time
0         D2KY6       20180115            746             836
1         344VM       20180115           1087            1195
2         3BRSC       20180115            354             825
3         HM6U8       20180115            525             800

In [56]:
query = '''
SELECT b.person_id, b.name
FROM get_fit_now_check_in  a INNER JOIN get_fit_now_member b
ON a.membership_id = b.id
WHERE a.check_in_date = 20180115
'''
list_persons = sql_query(query)
list_persons

   person_id              name
0      99602  Joline Hollering
1      13466      Armando Huie
2      19948      Taylor Skyes
3      50106       Edgar Bamba

In [58]:
query = '''
SELECT * 
FROM interview
WHERE person_id in (99602,13466,19948,50106)
'''
sql_query(query).transcript

0                                                   \n
1                    *    *    *    *    *    *    *\n
2       ‘You are old,’ said the youth, ‘and your ja...
Name: transcript, dtype: object